Repository: lardissone/pium
Catalog: Pium/Resources/Localizable.xcstrings
Source language: en
Languages: es

# about.licence
source: MIT licensed
es: Licencia MIT

# about.repository
source: View the source on GitHub
es: Ver el código en GitHub

# about.version %@
source: Version %@
es: Versión %@

# about.windowTitle
source: About Pium!
es: Acerca de Pium!

# action.copyDestination
source: Copy Link
es: Copiar enlace

# action.execute
source: Run
es: Ejecutar

# action.open
source: Open
es: Abrir

# action.revealInFinder
source: Reveal in Finder
es: Mostrar en Finder

# action.revealJSON
source: Reveal JSON in Finder
es: Mostrar JSON en Finder

# bookmark.destination.empty
source: A bookmark needs a destination.
es: Un marcador necesita un destino.

# bookmark.destination.unrecognized %@
source: “%@” is neither a link nor a path. A link carries a scheme, like https:// or obsidian://; a path starts with / or ~.
es: «%@» no es ni un enlace ni una ruta. Un enlace lleva un esquema, como https:// u obsidian://; una ruta empieza con / o ~.

# bookmark.open.applicationMissing %@
source: “%@” is not installed, so this opened with the default application.
es: «%@» no está instalada, así que esto se abrió con la aplicación por defecto.

# bookmark.open.unopenable %@
source: “%@” is not something macOS can open.
es: «%@» no es algo que macOS pueda abrir.

# bookmark.template.unclosed %@
source: “%@” opens {{ and never closes it.
es: «%@» abre {{ y nunca lo cierra.

# bookmark.template.unknownFilter %@
source: “%@” is not a filter Pium knows. A bookmark takes raw, and encodes for you otherwise.
es: «%@» no es un filtro que Pium conozca. Un marcador acepta raw, y si no, codifica por vos.

# bookmark.template.unknownVariable %@
source: “%@” is not something Pium can fill in. The only one a bookmark takes is {{input}}.
es: «%@» no es algo que Pium pueda completar. Lo único que un marcador acepta es {{input}}.

# bookmarks.add
source: Add a bookmark
es: Agregar un marcador

# bookmarks.delete.confirm
source: Delete
es: Borrar

# bookmarks.delete.message
source: This cannot be undone.
es: Esto no se puede deshacer.

# bookmarks.delete.title %@
source: Delete “%@”?
es: ¿Borrar «%@»?

# bookmarks.empty.body
source: Add one with the + below, and it will turn up in the launcher as soon as you type its name.
es: Agregá uno con el + de abajo y va a aparecer en el launcher apenas escribas su nombre.

# bookmarks.empty.title
source: No bookmarks yet
es: Todavía no hay marcadores

# bookmarks.favicon.disclosure
source: Pium asks each bookmarked site for its icon, once per site, and keeps the answer on this Mac. It is the only thing Pium fetches besides updates.
es: Pium le pide el icono a cada sitio marcado, una vez por sitio, y guarda la respuesta en esta Mac. Es lo único que Pium descarga además de las actualizaciones.

# bookmarks.field.destination
source: Destination
es: Destino

# bookmarks.field.keywords
source: Keywords
es: Palabras clave

# bookmarks.field.keywords.help
source: Separated by commas.
es: Separadas por comas.

# bookmarks.field.name
source: Name
es: Nombre

# bookmarks.field.openWith
source: Open with
es: Abrir con

# bookmarks.new
source: New bookmark
es: Marcador nuevo

# bookmarks.openWith.systemDefault
source: macOS default
es: Por defecto de macOS

# bookmarks.problem.nameIsEmpty
source: A bookmark needs a name.
es: Un marcador necesita un nombre.

# bookmarks.reading.link
source: Read as a link.
es: Se lee como un enlace.

# bookmarks.reading.path
source: Read as a place on this Mac.
es: Se lee como un lugar en esta Mac.

# bookmarks.reading.takesArgument
source: Pium will ask you for a value before opening it.
es: Pium te va a pedir un valor antes de abrirlo.

# bookmarks.remove
source: Delete the selected bookmark
es: Borrar el marcador seleccionado

# bookmarks.save
source: Save
es: Guardar

# bookmarks.whatIsAbookmark
source: A bookmark is something you name once and open from the launcher afterwards: a link, a file, a folder. Put {{input}} in the destination and Pium will ask you for a value before opening it.
es: Un marcador es algo que nombrás una vez y después abrís desde el launcher: un enlace, un archivo, una carpeta. Poné {{input}} en el destino y Pium te va a pedir un valor antes de abrirlo.

# execution.failure.alreadyRunning %@
source: %@ is still running
es: %@ todavía se está ejecutando

# execution.failure.invalidManifest %@
source: %@ could not be read as a plugin. Its problem is shown in Settings
es: %@ no se pudo leer como plugin. Su problema se muestra en Ajustes

# execution.failure.missing %@
source: There is no file at %@
es: No hay ningún archivo en %@

# execution.failure.missingConfiguration %@
source: “%@” has no value yet. Fill it in Settings
es: «%@» todavía no tiene valor. Completalo en Ajustes

# execution.failure.notExecutable %@
source: %@ is not executable. Give it permission with chmod +x
es: %@ no es ejecutable. Dale permiso con chmod +x

# execution.failure.notFound %@ %@
source: Could not find “%1$@”. Looked in: %2$@
es: No se encontró «%1$@». Se buscó en: %2$@

# execution.failure.quarantined %@
source: macOS quarantined %@ because it was downloaded. Clear it with xattr -d com.apple.quarantine
es: macOS puso %@ en cuarentena porque se descargó. Quitala con xattr -d com.apple.quarantine

# execution.failure.secretUnavailable %@
source: The Keychain would not give up the secret for “%@”
es: El Llavero no entregó el secreto de «%@»

# execution.failure.spawnFailed %lld
source: The command could not be started (error %lld)
es: No se pudo iniciar el comando (error %lld)

# folder.desktop
source: Desktop
es: Escritorio

# folder.documents
source: Documents
es: Documentos

# folder.downloads
source: Downloads
es: Descargas

# hud.copy
source: Copy
es: Copiar

# hud.exited %lld
source: It ended with error code %lld and said nothing
es: Terminó con el código de error %lld y no dijo nada

# hud.signalled %lld
source: It was stopped by signal %lld
es: Lo detuvo la señal %lld

# hud.timedOut
source: It ran longer than the time the plugin allows
es: Corrió más tiempo del que el plugin permite

# hud.truncated
source: …output was cut short
es: …la salida se cortó

# launcher.actions
source: Actions
es: Acciones

# launcher.argument.accessibilityLabel %@
source: Argument for %@
es: Argumento para %@

# launcher.argument.leave %@
source: Leave %@ and return to search
es: Salir de %@ y volver a la búsqueda

# launcher.argument.placeholder
source: Type an argument
es: Escribí un argumento

# launcher.cancel
source: Cancel
es: Cancelar

# launcher.confirm
source: Confirm
es: Confirmar

# launcher.confirmCancel
source: Cancel
es: Cancelar

# launcher.noResults
source: No results
es: Sin resultados

# launcher.placeholder
source: Search apps, files, and commands
es: Buscar apps, archivos y comandos

# launcher.running %@
source: Running %@
es: Ejecutando %@

# launcher.search.accessibilityLabel
source: Search
es: Buscar

# launcher.searchActions
source: Search for actions…
es: Buscar acciones…

# menubar.about
source: About Pium!
es: Acerca de Pium!

# menubar.cancel %@
source: Cancel “%@”
es: Cancelar «%@»

# menubar.checkForUpdates
source: Check for Updates…
es: Buscar actualizaciones…

# menubar.openPium
source: Open Pium!
es: Abrir Pium!

# menubar.openPluginsFolder
source: Open Plugins Folder
es: Abrir carpeta de plugins

# menubar.quit
source: Quit Pium!
es: Salir de Pium!

# menubar.reloadPlugins
source: Reload Plugins
es: Recargar plugins

# menubar.settings
source: Settings…
es: Ajustes…

# onboarding.allowFolders
source: Allow Searching Documents, Desktop and Downloads
es: Permitir buscar en Documentos, Escritorio y Descargas

# onboarding.allowFoldersExplanation
source: macOS hides these from search until you allow it. You can change this later in Settings.
es: macOS las oculta de la búsqueda hasta que lo permitas. Podés cambiarlo después en Ajustes.

# onboarding.finish
source: Get Started
es: Empezar

# onboarding.foldersAllowed
source: Pium! can search those folders.
es: Pium! puede buscar en esas carpetas.

# onboarding.foldersBlocked
source: You can change this later in Settings.
es: Podés cambiarlo después en Ajustes.

# onboarding.pluginsExplanation
source: Plugins are local commands described by a JSON file.
es: Los plugins son comandos locales descritos por un archivo JSON.

# onboarding.revealPluginsFolder
source: Open Plugins Folder
es: Abrir carpeta de plugins

# onboarding.shortcutIntro %@
source: Press %@ from any app to open Pium! You can change this in Settings.
es: Presioná %@ desde cualquier app para abrir Pium! Podés cambiarlo en Ajustes.

# onboarding.windowTitle
source: Welcome to Pium!
es: Bienvenido a Pium!

# plugin.diagnostic.conflictingAlias %@
source: Another plugin already uses the alias “%@”.
es: Otro plugin ya usa el alias «%@».

# plugin.diagnostic.duplicateConfigurationKey %@
source: Configuration key “%@” is declared more than once.
es: La clave de configuración «%@» está declarada más de una vez.

# plugin.diagnostic.duplicateEnvironmentVariable %@
source: Environment variable “%@” is declared by more than one field.
es: La variable de entorno «%@» está declarada por más de un campo.

# plugin.diagnostic.duplicateIdentifier %@
source: Another plugin already uses the id “%@”.
es: Otro plugin ya usa el id «%@».

# plugin.diagnostic.invalidConfigurationKey %@
source: “%@” is not a valid configuration key. Use letters, digits, underscores, and hyphens, starting with a letter.
es: «%@» no es una clave de configuración válida. Usá letras, dígitos, guiones bajos y guiones, empezando con una letra.

# plugin.diagnostic.invalidEnvironmentVariable %@
source: “%@” is not a valid environment variable name. Use capitals, digits, and underscores, starting with a capital.
es: «%@» no es un nombre válido de variable de entorno. Usá mayúsculas, dígitos y guiones bajos, empezando con una mayúscula.

# plugin.diagnostic.invalidIdentifier %@
source: “%@” is not a valid id. Use lowercase letters, digits, dots, and hyphens.
es: «%@» no es un id válido. Usá minúsculas, dígitos, puntos y guiones.

# plugin.diagnostic.invalidTemplate %@
source: Invalid argument template: %@
es: Plantilla de argumento inválida: %@

# plugin.diagnostic.invalidTimeout %lld
source: timeoutSeconds must be between 1 and 3600, not %lld.
es: timeoutSeconds tiene que estar entre 1 y 3600, no %lld.

# plugin.diagnostic.malformedJSON %@
source: This file is not valid JSON: %@
es: Este archivo no es JSON válido: %@

# plugin.diagnostic.missingKey %@
source: Missing required key “%@”.
es: Falta la clave obligatoria «%@».

# plugin.diagnostic.reservedConfigurationKey %@
source: “%@” is reserved: it is the name of the plugin's own input in a template. Rename the field.
es: «%@» está reservada: es el nombre de la entrada del propio plugin en una plantilla. Renombrá el campo.

# plugin.diagnostic.rootObject
source: the manifest
es: el manifiesto

# plugin.diagnostic.secretInArguments %@
source: Secret “%@” cannot be used in arguments. Secrets reach the command only as environment variables.
es: El secreto «%@» no puede usarse en los argumentos. Los secretos llegan al comando solo como variables de entorno.

# plugin.diagnostic.unknownKey %@ %@
source: Unknown key “%1$@” in %2$@.
es: Clave desconocida «%1$@» en %2$@.

# plugin.diagnostic.unreadableFile
source: This file could not be read.
es: No se pudo leer este archivo.

# plugin.diagnostic.unsupportedSchemaVersion %lld %lld
source: Schema version %1$lld is not supported. This version of Pium! reads version %2$lld.
es: La versión de esquema %1$lld no está soportada. Esta versión de Pium! lee la versión %2$lld.

# plugin.diagnostic.wrongType %@ %@
source: %1$@ must be %2$@.
es: %1$@ tiene que ser %2$@.

# plugin.state.missingConfiguration %@
source: Needs configuration: %@
es: Falta configurar: %@

# plugin.template.unclosed %@
source: “%@” has an unclosed {{ placeholder.
es: «%@» tiene un marcador {{ sin cerrar.

# plugin.template.unknownFilter %@
source: “%@” is not a known filter. Use url_encode, or no filter at all.
es: «%@» no es un filtro conocido. Usá url_encode, o ningún filtro.

# plugin.template.unknownVariable %@
source: “%@” is not a known variable. Only {{input}} is available.
es: «%@» no es una variable conocida. Solo está disponible {{input}}.

# plugin.type.array
source: an array
es: un arreglo

# plugin.type.boolean
source: true or false
es: true o false

# plugin.type.integer
source: a whole number
es: un número entero

# plugin.type.nonEmptyText
source: text that is not empty
es: texto no vacío

# plugin.type.object
source: an object
es: un objeto

# plugin.type.string
source: text
es: texto

# plugins.whatIsAplugin
source: A plugin is a command that runs on your Mac as you. Pium! does not review what a plugin does — read a plugin before you install it.
es: Un plugin es un comando que corre en tu Mac con tu usuario. Pium! no revisa lo que hace un plugin — leé un plugin antes de instalarlo.

# result.kind.application
source: Application
es: Aplicación

# result.kind.bookmark
source: Bookmark
es: Marcador

# result.kind.file
source: File
es: Archivo

# result.kind.plugin
source: Command
es: Comando

# settings.advanced.debugCancel
source: Cancel
es: Cancelar

# settings.advanced.debugEnable
source: Turn On
es: Activar

# settings.advanced.debugExplanation
source: Logs stay on this Mac, in Application Support. They are kept for seven days or 20 MB, whichever comes first.
es: Los registros quedan en esta Mac, en Application Support. Se guardan siete días o 20 MB, lo que pase primero.

# settings.advanced.debugLogging
source: Debug logging
es: Registro de depuración

# settings.advanced.debugRemaining
source: Stops in
es: Se apaga en

# settings.advanced.debugRenew
source: Another day
es: Un día más

# settings.advanced.debugWarning
source: Debug logging records what you type, the arguments you pass, the commands Pium runs, and what they print. Declared secrets are removed. A secret you type into a plugin's argument cannot be. Logging stops on its own after 24 hours.
es: El registro de depuración guarda lo que escribís, los argumentos que pasás, los comandos que Pium ejecuta y lo que imprimen. Los secretos declarados se quitan. Un secreto que escribas dentro del argumento de un plugin, no. El registro se apaga solo a las 24 horas.

# settings.advanced.debugWarningTitle
source: Turn on debug logging?
es: ¿Activar el registro de depuración?

# settings.advanced.deleteLogs
source: Delete Logs
es: Borrar registros

# settings.advanced.diagnostics
source: Diagnostics
es: Diagnóstico

# settings.advanced.effectivePath
source: Plugins receive
es: Los plugins reciben

# settings.advanced.exportFailed
source: The logs could not be written there.
es: No se pudieron escribir los registros ahí.

# settings.advanced.exportLogs
source: Export Logs…
es: Exportar registros…

# settings.advanced.exportWarning
source: The exported file contains your search text, plugin arguments, and command output. Read it before sending it to anyone.
es: El archivo exportado contiene tu texto de búsqueda, los argumentos de los plugins y la salida de los comandos. Leelo antes de mandárselo a alguien.

# settings.advanced.path
source: Where plugin commands are found
es: Dónde se buscan los comandos de plugins

# settings.advanced.pathAdd
source: Add
es: Agregar

# settings.advanced.pathExplanation
source: This is the PATH a plugin's command runs with — not where Pium looks for applications or files, which is in Search. Directories added here are searched after Pium's own, so a plugin can find a tool the defaults miss without replacing one that already works.
es: Este es el PATH con el que se ejecuta el comando de un plugin — no es dónde Pium busca aplicaciones o archivos, que está en Búsqueda. Los directorios que agregues acá se buscan después de los de Pium, así un plugin puede encontrar una herramienta que falte sin reemplazar una que ya funciona.

# settings.advanced.pathMissing
source: Not found
es: No existe

# settings.advanced.pathRemove
source: Remove
es: Quitar

# settings.advanced.pathRemoveLabel %@
source: Remove %@
es: Quitar %@

# settings.advanced.title
source: Advanced
es: Avanzado

# settings.appearance.anchor.bottomCenter
source: Bottom center
es: Abajo al centro

# settings.appearance.anchor.bottomLeft
source: Bottom left
es: Abajo a la izquierda

# settings.appearance.anchor.bottomRight
source: Bottom right
es: Abajo a la derecha

# settings.appearance.anchor.topCenter
source: Top center
es: Arriba al centro

# settings.appearance.anchor.topLeft
source: Top left
es: Arriba a la izquierda

# settings.appearance.anchor.topRight
source: Top right
es: Arriba a la derecha

# settings.appearance.hudPosition
source: Where results appear
es: Dónde aparecen los resultados

# settings.appearance.hudPositionExplanation
source: A command's result appears here, on the display the launcher was on when you started it.
es: El resultado de un comando aparece acá, en la pantalla donde estaba el launcher cuando lo iniciaste.

# settings.appearance.preview
source: Show Me
es: Mostrame

# settings.appearance.previewBody
source: A result appears here.
es: Un resultado aparece acá.

# settings.appearance.title
source: Appearance
es: Apariencia

# settings.bookmarks.title
source: Bookmarks
es: Marcadores

# settings.general.language
source: Language
es: Idioma

# settings.general.languageRestartNote
source: Language changes take effect the next time Pium! starts.
es: Los cambios de idioma se aplican la próxima vez que se inicie Pium!

# settings.general.launchAtLogin
source: Launch at login
es: Abrir al iniciar sesión

# settings.general.shortcut
source: Shortcut
es: Atajo

# settings.language.english
source: English
es: Inglés

# settings.language.spanish
source: Spanish
es: Español

# settings.language.system
source: System
es: Sistema

# settings.plugins.arguments
source: Arguments
es: Argumentos

# settings.plugins.clearSecret
source: Clear
es: Borrar

# settings.plugins.command
source: Command
es: Comando

# settings.plugins.commandExplanation
source: Shown as the manifest declares it. Pium! resolves the executable when it runs the command.
es: Se muestra tal como lo declara el manifiesto. Pium! resuelve el ejecutable cuando ejecuta el comando.

# settings.plugins.configuration
source: Configuration
es: Configuración

# settings.plugins.enabled %@
source: Enable %@
es: Activar %@

# settings.plugins.environment
source: Environment
es: Entorno

# settings.plugins.eraseFailed %@
source: Could not erase the secrets for %@.
es: No se pudieron borrar los secretos de %@.

# settings.plugins.eraseSecrets
source: Erase
es: Borrar

# settings.plugins.executable
source: Executable
es: Ejecutable

# settings.plugins.file
source: File
es: Archivo

# settings.plugins.noSelection
source: Select a plugin
es: Elegí un plugin

# settings.plugins.orphanedExplanation
source: These plugins are no longer in the folder. Their secrets are kept in case the file comes back, and are erased only when you say so.
es: Estos plugins ya no están en la carpeta. Sus secretos se conservan por si el archivo vuelve, y se borran solo cuando vos lo decidís.

# settings.plugins.orphanedSecrets
source: Saved credentials
es: Credenciales guardadas

# settings.plugins.pluginFolder
source: The plugin's folder
es: La carpeta del plugin

# settings.plugins.problem
source: Problem
es: Problema

# settings.plugins.requiredField %@
source: %@ (required)
es: %@ (obligatorio)

# settings.plugins.saveFailed %@
source: Could not save %@.
es: No se pudo guardar %@.

# settings.plugins.secretMissing
source: Not stored
es: Sin guardar

# settings.plugins.secretPrompt
source: Paste the secret
es: Pegá el secreto

# settings.plugins.secretStored
source: Stored in the Keychain
es: Guardado en el Llavero

# settings.plugins.secretsExplanation
source: Secrets are kept in the macOS Keychain and reach the command only as environment variables, never as arguments.
es: Los secretos se guardan en el Llavero de macOS y llegan al comando solo como variables de entorno, nunca como argumentos.

# settings.plugins.status.disabled
source: Disabled
es: Desactivado

# settings.plugins.status.invalid
source: Not loaded
es: No cargado

# settings.plugins.status.needsConfiguration
source: Needs configuration
es: Falta configurar

# settings.plugins.status.ready
source: Ready
es: Listo

# settings.plugins.valuePrompt
source: Type a value
es: Escribí un valor

# settings.plugins.workingDirectory
source: Working directory
es: Directorio de trabajo

# settings.search.clearHistory
source: Erase usage history
es: Borrar historial de uso

# settings.search.clearHistoryExplanation
source: Pium! learns which results you pick so they come back first. Erasing this cannot be undone.
es: Pium! aprende qué resultados elegís para mostrarlos primero. Borrar esto no se puede deshacer.

# settings.search.excluded
source: Excluded from results
es: Excluido de los resultados

# settings.search.excludedAdd
source: Add
es: Agregar

# settings.search.excludedChoose
source: Choose…
es: Elegir…

# settings.search.excludedChooseMessage
source: Choose the files and folders to keep out of file results
es: Elegí los archivos y carpetas que no querés ver en los resultados

# settings.search.excludedExplanation
source: A name such as node_modules hides that folder wherever it is. A path hides one place and everything inside it. A pattern such as **/[Cc]ache/** hides whatever it matches.
es: Un nombre como node_modules oculta esa carpeta esté donde esté. Una ruta oculta un solo lugar y todo lo que contiene. Un patrón como **/[Cc]ache/** oculta lo que coincida con él.

# settings.search.excludedPlaceholder
source: Folder name, path, or pattern
es: Nombre de carpeta, ruta o patrón

# settings.search.excludedRemove
source: Remove
es: Quitar

# settings.search.excludedRemoveLabel %@
source: Remove %@
es: Quitar %@

# settings.search.fileSearch
source: Search files
es: Buscar archivos

# settings.search.fileSearchExplanation
source: Uses the existing Spotlight index. Turning this off stops Pium! querying Spotlight at all.
es: Usa el índice de Spotlight existente. Al desactivarlo, Pium! deja de consultar Spotlight por completo.

# settings.search.folderAllow
source: Allow
es: Permitir

# settings.search.folderAllowed
source: Allowed
es: Permitido

# settings.search.folderBlocked
source: Blocked
es: Bloqueado

# settings.search.folderOpenSettings
source: Open System Settings
es: Abrir Ajustes del Sistema

# settings.search.folders
source: Protected Folders
es: Carpetas protegidas

# settings.search.foldersExplanation
source: macOS hides these folders from search until you allow it. Pium! never asks for Full Disk Access.
es: macOS oculta estas carpetas de la búsqueda hasta que lo permitas. Pium! nunca pide Acceso Total al Disco.

# settings.search.historyErased
source: Usage history erased.
es: Historial de uso borrado.

# settings.search.scope
source: Look in
es: Buscar en

# settings.search.scope.allIndexedLocal
source: All indexed volumes
es: Todos los volúmenes indexados

# settings.search.scope.home
source: Home folder
es: Carpeta personal

# settings.search.title
source: Search
es: Búsqueda

# settings.search.usageHistory
source: Usage history
es: Historial de uso

# settings.shortcut.accessibilityLabel
source: Launcher shortcut
es: Atajo del lanzador

# settings.shortcut.recording
source: Press a shortcut…
es: Presioná un atajo…

# settings.updates.automatic
source: Check automatically
es: Comprobar automáticamente

# settings.updates.automatic.explanation
source: Pium checks every six hours and tells you the next time you open it. It never installs an update on its own.
es: Pium comprueba cada seis horas y te avisa la próxima vez que lo abras. Nunca instala una actualización por su cuenta.

# settings.updates.checkNow
source: Check Now
es: Comprobar ahora
